import sys
input = sys.stdin.readline

N, M = map(int, input().split())
board = [list(map(int, input().split())) for _ in range(N)]

shapes = [
    # ㅡ 모양
    [(0,0),(0,1),(0,2),(0,3)],
    [(0,0),(1,0),(2,0),(3,0)],
    # ㅁ 모양
    [(0,0),(0,1),(1,0),(1,1)],
    # ㄴ 모양
    [(0,0),(1,0),(2,0),(2,1)],
    [(0,1),(1,1),(2,1),(2,0)],
    [(0,0),(0,1),(1,1),(2,1)],
    [(0,0),(0,1),(1,0),(2,0)],
    [(0,0),(1,0),(1,1),(1,2)],
    [(0,2),(1,0),(1,1),(1,2)],
    [(0,0),(0,1),(0,2),(1,2)],
    [(0,0),(0,1),(0,2),(1,0)],
    # 번갈아 꼬인 모양
    [(0,0),(1,0),(1,1),(2,1)],
    [(0,1),(1,1),(1,0),(2,0)],
    [(0,1),(0,2),(1,0),(1,1)],
    [(0,0),(0,1),(1,1),(1,2)],
    # ㅗ 모양들
    [(0,0),(0,1),(0,2),(1,1)],
    [(0,1),(1,0),(1,1),(2,1)],
    [(1,0),(1,1),(1,2),(0,1)],
    [(0,0),(1,0),(1,1),(2,0)],
]

result = 0

for i in range(N):
    for j in range(M):
        for shape in shapes:
            temp = 0
            for dx, dy in shape:
                nx = i + dx
                ny = j + dy
                if not(0 <= nx < N and 0 <= ny < M):
                    temp = -1
                    break
                temp += board[nx][ny]
            if temp != -1:
                result = max(result, temp)

print(result)